---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.Alignment.GetClosestPoint(Autodesk.Revit.DB.XYZ)
source: html/0b004219-f718-4fde-d86c-b85475c6691a.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.GetClosestPoint Method

Calculates the point on the alignment's geometry which is closest to the given model point.

## Syntax (C#)
```csharp
public XYZ GetClosestPoint(
	XYZ point
)
```

## Parameters
- **point** (`Autodesk.Revit.DB.XYZ`) - The model point for which to calculate the closest point.

## Returns
The alignment point closest to the given model point.